Revit 2026 API

# SATExportOptions(SATExportOptions) Constructor

---

Constructs a new instance of SATImportOptions as a copy of the export options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SATExportOptions(
	SATExportOptions option
)
```
```vb
Public Sub New (
	option As SATExportOptions
)
```
```cpp
public:
SATExportOptions(
	SATExportOptions^ option
)
```
```fsharp
new :
        option : SATExportOptions -> SATExportOptions
```

#### Parameters

option SATExportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SATExportOptions Class

SATExportOptions Overload

Autodesk.Revit.DB Namespace